## Датасет собран из базы данных переписи 1994 года и содержит данные о доходах.
### Информация о данных:
* age: continuous.
* workclass: Private, Self-emp-not-inc, Self-emp-inc, Federal-gov, Local-gov, State-gov, Without-pay, Never-worked.
* fnlwgt: continuous.
* education: Bachelors, Some-college, 11th, HS-grad, Prof-school, Assoc-acdm, Assoc-voc, 9th, 7th-8th, 12th, * Masters, 1st-4th, 10th, Doctorate, 5th-6th, Preschool.
* education-num: continuous.
* marital-status: Married-civ-spouse, Divorced, Never-married, Separated, Widowed, Married-spouse-absent, Married-AF-spouse.
* occupation: Tech-support, Craft-repair, Other-service, Sales, Exec-managerial, Prof-specialty, Handlers-cleaners, Machine-op-inspct, Adm-clerical, Farming-fishing, Transport-moving, Priv-house-serv, Protective-serv, Armed-Forces.
* relationship: Wife, Own-child, Husband, Not-in-family, Other-relative, Unmarried.
* race: White, Asian-Pac-Islander, Amer-Indian-Eskimo, Other, Black.
* sex: Female, Male.
* capital-gain: continuous.
* capital-loss: continuous.
* hours-per-week: continuous.
* native-country: United-States, Cambodia, England, Puerto-Rico, Canada, Germany, Outlying-US(Guam-USVI-etc), India, Japan, Greece, South, China, Cuba, Iran, Honduras, Philippines, Italy, Poland, Jamaica, Vietnam, Mexico, Portugal, Ireland, France, Dominican-Republic, Laos, Ecuador, Taiwan, Haiti, Columbia, Hungary, Guatemala, Nicaragua, Scotland, Thailand, Yugoslavia, El-Salvador, Trinadad&Tobago, Peru, Hong, Holand-Netherlands.
* salary: >50K,<=50K

## Проведите анализ данных при помощи Pandas выполнив поставленные задачи.
####

In [2]:
import pandas as pd
import numpy as np

In [3]:
# загружаем датасет
data = pd.read_csv("./data/adult.data.csv")
data.head()

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

**1. Посчитайте, сколько мужчин и женщин (признак *sex*) представлено в этом датасете**

In [4]:
data['sex'].value_counts()

Male      21790
Female    10771
Name: sex, dtype: int64

**2. Каков средний возраст мужчин (признак *age*) по всему датасету?**

In [149]:
round(data[data['sex'] == 'Male']['age'].mean(), 2)

39.43

**3. Какова доля граждан Соединенных Штатов (признак *native-country*)?**

In [148]:
round(100 * data[data['native-country'] == 'United-States'].shape[0] / data.shape[0], 2)

89.59

**4-5. Рассчитайте среднее значение и среднеквадратичное отклонение возраста тех, кто получает более 50K в год (признак *salary*) и тех, кто получает менее 50K в год**

In [30]:
grouped_mean_age_by_salary = data[['age', 'salary']].groupby('salary').mean().rename(columns={'age': 'mean_age'})
grouped_std_age_by_salary = data[['age', 'salary']].groupby('salary').std().rename(columns={'age': 'std_age'})

pd.merge(grouped_std_age_by_salary, grouped_mean_age_by_salary, how='inner', on='salary')

          std_age   mean_age
salary
<=50K   14.020088  36.783738
>50K    10.519028  44.249841

**6. Правда ли, что люди, которые получают больше 50k, имеют минимум высшее образование? (признак *education – Bachelors, Prof-school, Assoc-acdm, Assoc-voc, Masters* или *Doctorate*)**

In [37]:
# The answer is NO. That dataset also includes people who earn more than 50K and don't have higher education
higher_education  = {'Bachelors', 'Prof-school', 'Assoc-acdm', 'Assoc-voc', 'Masters', 'Doctorate'}
set(data[(data['salary'] == '>50K')]['education'].unique()) == higher_education

False

**7. Выведите статистику возраста для каждой расы (признак *race*) и каждого пола. Используйте *groupby* и *describe*. Найдите таким образом максимальный возраст мужчин расы *Asian-Pac-Islander*.**

In [58]:
# first q
display(data[['race', 'age']].groupby(['race']).describe())
# second q
display(data[['sex', 'age']].groupby(['sex']).describe())

# third q, Instead of groupBy I used max() for getting only the max value from the statistics
data.loc[(data['race'] == 'Asian-Pac-Islander') & (data['sex'] == 'Male')][['race', 'age']].groupby(['race']).max()

                        age                                                \
                      count       mean        std   min   25%   50%   75%
race
Amer-Indian-Eskimo    311.0  37.173633  12.447130  17.0  28.0  35.0  45.5
Asian-Pac-Islander   1039.0  37.746872  12.825133  17.0  28.0  36.0  45.0
Black                3124.0  37.767926  12.759290  17.0  28.0  36.0  46.0
Other                 271.0  33.457565  11.538865  17.0  25.0  31.0  41.0
White               27816.0  38.769881  13.782306  17.0  28.0  37.0  48.0


                     max
race
Amer-Indian-Eskimo  82.0
Asian-Pac-Islander  90.0
Black               90.0
Other               77.0
White               90.0

            age
          count       mean        std   min   25%   50%   75%   max
sex
Female  10771.0  36.858230  14.013697  17.0  25.0  35.0  46.0  90.0
Male    21790.0  39.433547  13.370630  17.0  29.0  38.0  48.0  90.0

                    age
race
Asian-Pac-Islander   90

**8. Среди кого больше доля зарабатывающих много (>50K): среди женатых или холостых мужчин (признак *marital-status*)? Женатыми считаем тех, у кого *marital-status* начинается с *Married* (Married-civ-spouse, Married-spouse-absent или Married-AF-spouse), остальных считаем холостыми.**

In [105]:
well_paid_men = data[(data['salary'] == '>50K') & (data['sex'] == 'Male')].copy()
well_paid_men['marital-status-binary'] = np.where(well_paid_men['marital-status'].str.startswith('Married'), 'married', 'singe')

well_paid_men[['salary', 'marital-status-binary']].groupby('marital-status-binary').count().rename(columns={'salary': '>50K'}) / well_paid_men.shape[0]

                           >50K
marital-status-binary
married                0.895377
singe                  0.104623

**9. Какое максимальное число часов человек работает в неделю (признак *hours-per-week*)? Сколько людей работают такое количество часов и каков среди них процент зарабатывающих много?**

In [106]:
# first q
max_hours_per_week = data['hours-per-week'].max()
display(f'Max hours per week - {max_hours_per_week}')

# second q
workaholics_count = data[data['hours-per-week'] == max_hours_per_week].shape[0]
display(f'{workaholics_count} work {max_hours_per_week} per week')

# third q
well_paid_workaholics_count = data[(data['hours-per-week'] == max_hours_per_week) & (data['salary'] == '>50K')].shape[0]

display(f'Percent of workaholics who earn more than 50K {round(100 * well_paid_workaholics_count / workaholics_count, 2)}%')

'Max hours per week - 99'

'85 work 99 per week'

'Percent of workaholics who earn more than 50K 29.41%'

**10. Посчитайте среднее время работы (*hours-per-week*) зарабатывающих мало и много (*salary*) для каждой страны (*native-country*).**

In [113]:
# I excluded data that has "?" in `native-country` column 
data[data['native-country'] != '?'].groupby(['native-country', 'salary']).agg({'hours-per-week': 'mean'})

                       hours-per-week
native-country salary
Cambodia       <=50K        41.416667
               >50K         40.000000
Canada         <=50K        37.914634
               >50K         45.641026
China          <=50K        37.381818
...                               ...
United-States  >50K         45.505369
Vietnam        <=50K        37.193548
               >50K         39.200000
Yugoslavia     <=50K        41.600000
               >50K         49.500000

[80 rows x 1 columns]

**11.Сгруппируйте людей по возрастным группам *young*, *adult*, *retiree*, где:**
* *young* соответствует 16-35 лет
* *adult* - 35-70 лет
* *retiree* - 70-100 лет

**Проставьте название соответсвтуещей группы для каждого человека в новой колонке AgeGroup**

In [125]:
conditions = [
    (data['age'] >= 16) & (data['age'] < 35),
    (data['age'] >= 35) & (data['age'] < 70),
    (data['age'] >= 70) & (data['age'] < 100)]
choices = ['young', 'adult', 'retiree']

data['AgeGroup'] = np.select(conditions, choicelist=choices)
data['AgeGroup'].value_counts()

adult      17883
young      14049
retiree      629
Name: AgeGroup, dtype: int64

**12-13. Определите количество зарабатывающих >50K в каждой из возрастных групп (колонка AgeGroup), а также выведите название возрастной группы, в которой чаще зарабатывают больше 50К (>50K)**

In [139]:
# first q 
data_grouped_by_ageGroup = data.query('salary == ">50K"').groupby('AgeGroup').agg({'salary': 'count'}).rename(columns={'salary': '>50K'})
display(data_grouped_by_ageGroup)

# second q
largest_well_paid_age_group = data_grouped_by_ageGroup.idxmax()
display(f'{largest_well_paid_age_group[0]} more often earn >50K than others' )

          >50K
AgeGroup
adult     6240
retiree    113
young     1488

'adult more often earn >50K than others'

**14. Сгруппируйте людей по типу занятости (колонка occupation) и определите количество людей в каждой группе. После чего напишите функциюю фильтрации filter_func, которая будет возвращать только те группы, в которых средний возраст (колонка age) не больше 40 и в которых все работники отрабатывают более 5 часов в неделю (колонка hours-per-week)**

In [144]:
# first q
display(data['occupation'].value_counts())

# second q
def filter_func(df: pd.DataFrame) -> pd.DataFrame:
    return df.groupby('occupation').agg({'age': 'mean', 'hours-per-week': 'min'}).query('age <= 40 and `hours-per-week` > 5')

filter_func(data)

Prof-specialty       4140
Craft-repair         4099
Exec-managerial      4066
Adm-clerical         3770
Sales                3650
Other-service        3295
Machine-op-inspct    2002
?                    1843
Transport-moving     1597
Handlers-cleaners    1370
Farming-fishing       994
Tech-support          928
Protective-serv       649
Priv-house-serv       149
Armed-Forces            9
Name: occupation, dtype: int64

                    age  hours-per-week
occupation
Armed-Forces  30.222222               8